Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 江逸脸色一变，荣管事给他的令牌他可是拿给风月楼抵押了，此刻拿什么上交啊？
en_us: Jiang Yi's face changed. The command token that Chief Rong gave him was now impawned by the people at the Fengyue Brothel. What could he possibly hand up to Chief Rong at that moment?

source: 江逸脸色一沉，暗道如果自己有铸鼎境二重配合黑色元力的话，绝对要把那群人打得屁滚尿流，可惜这黑色元力有很多神奇功能，就是不能辅助修炼……
en_us: Jiang Yi's heart sunk. If only my power level was at the second stage of the Cast Tripod Realm... Should he combine that power with black essence force, he could definitely beat that group of people to a pulp. Unfortunately for all the magical powers of this black essence force, it just could not be used to accelerate his essence force refinement...

source: 江逸脸色完全沉了下来，从牙缝内蹦出几个字：“多少？”
en_us: Jiang Yi's expression had darkened completely. He forced two words past his teeth: "How much?"

source: 江逸脸色沉了下来，他眸子转动几圈，沉吟片刻咬牙道：“小奴，你乖乖呆在家，我先出去一趟。”
en_us: Jiang Yi's face darkened. Rolling his pupils about for several rounds, he sighed deeply for a short moment, gritted his teeth, and said, "Xiaonu, you stay at home obediently. I'll be heading out for a while first."

source: 江逸脸色突然变得狰狞起来，猛然扭头盯着钱万贯吼道：“我再和你说一遍，我没有父亲，就算江别离出现在我面前，我也会一刀砍了他！以后你再敢说这样的话，信不信我宰了你？”
en_us: Jiang Yi's face suddenly turned grim, and he whipped his head back to stare at Qian Wanguan. He hollered, "I repeat one more time. I do not have a father. Even if Jiang Bieli appeared in front of me, I would kill him! If you dare mention this ever again, don't blame me for hurting you too."

source: 江逸苍狼面具之下的双眼光芒一闪，沉声问道：“交易？”
en_us: Under his wolf mask, Jiang Yi's eyes lit up. He asked in a low voice, "A deal?"

source: 江逸苦恼的抓着脑袋，不过很快就将不知足的烦恼抛在一边，又兴奋的站起来，输送黑色元力到右拳和江水诀蓝色元力融合，右拳对着地面的青石板再次砸去。
en_us: Jiang Yi scratched his head, vexed, but he quickly pushed aside his frustrations. He stood up again and transferred the black essence force to his right fist to fuse with the Jiang Water Art's blue essence force once again. He smashed his right fist onto the limestone slab on the floor.

source: 江逸苦涩一笑，想起年少时，两人一起学习武技的情景，那时候江恨水总是对他不服气，经常一起比试，两人关系还算不错。不过后来因为江逸被查出丹田被封印，加上大长老的失踪，两人才越来越疏远，距离上次见面都有两三年了，江恨水一时之间没认出他也正常。
en_us: Jiang Yi bitterly smiled as he thought about the time when he was younger and the scenes when the two of them practiced martial arts together. At the time, Jiang Henshui was never satisfied with their difference in skills and thus they regularly sparred against each other. As such, the relationship between the two boys could be considered to be pretty good. However, with the revelation that Jiang Yi's dantian was sealed, coupled with the disappearance of the Grand Elder, the two of them became increasingly estranged. The last time they met had been two to three years ago. As such, it was not out of the ordinary that Jiang Henshui could not recognize him instantly.

source: 江逸苦涩的笑了笑，那日他在聚珍阁就是化名易剑。不过被认出来了，他心里反而没那么别扭了，目光平静的望着姬听雨问道：“姬小姐，你是怎么认出我来的？那日你并没有看到我的眼睛吧？”
en_us: Jiang Yi smiled with some bitter agony. That day, he had used that pseudonym "Yi Jian" at the Pearl Gathering Pavilion. However, after being so easily and quickly recognised, his heart did not feel so wrung and pained as before. Instead, he looked at Ji Tingyu with a tranquil gaze and asked, "Young Mistress Ji, how did you recognise me? You did not see my eyes that day, did you?"

source: 江逸苦笑起来：“你也不怕亏了？我的人情万一不值钱呢？”
en_us: Jiang Yi forced a smile and said, " Are you sure? What if my favor is not even worth a penny? Are you not afraid of losing out?"

source: 江逸苦笑，他身上倒是有十枚灵神丹，不过才是刚买的……好在整张脸笼罩在斗篷内，刘管事看不到他的神情，他起身拱手道：“刘管事，在下想见一下你们小姐，有一事相求！”
en_us: Jiang Yi laughed bitterly. He did actually have ten Spirit Pills on his person, but he'd just purchased them. Thankfully for him, his entire face was shrouded within his cloak and as such, Housekeeper Liu could not see his expression. He stood up and cupped his hands. "Housekeeper Liu, I would like to meet your young mistress. I have something to ask of her!"

source: 江逸苦笑：“姬小姐，我这个人不喜欢麻烦，喜欢平静一些的生活……”
en_us: Jiang Yi smiled bitterly, "Young Mistress Ji, I don't like disturbances. I prefer to a more peaceful life..."

source: 江逸虽然修行效果受到封印限制，效果颇微，但每次修行的时候都是很认真，全神贯注的。但这一次不知为什么明显有些心不在焉，好几次将气血运行错了线路，幸好及时纠正才没走火入魔。然而他脑海中的几十个黑色文字总在他的眼前晃来晃去，让他静不下心来。
en_us: Although the effects of the martial arts practice were severely limited by the magical seal, Jiang Yi still took his essence force training very seriously and concentrated all his attention on practicing. However, preoccupied with other thoughts, he had accidentally transferred his blood down the wrong circulatory route a number of times. He was lucky he was able to rectify the error before he suffered from deviated Qi. Nonetheless, he was distracted by the black script in his mind that kept swaying and moving about in front of his vision. It left him unable to calm down.

source: 江逸虽然元力不足，但对于武技的掌控却是异常纯熟，既然下了决心要收拾对方，怎容江豹躲避？便将蛇鞭腿淋漓尽致地发挥出来，两条长腿便如毒蛇附骨一般，一次次扫在江豹的后背上。
en_us: Jiang Yi had little essence force, but he was highly skilled at utilizing various techniques. Since he had already made up his mind to get rid of him, how could he let Jiang Bao escape? Jiang Yi pushed the Snake Whip Leg to its full potential, and his legs shot out like two ferocious snakes, sweeping across Jiang Bao's back, again and again.

source: 江逸被吓到了，连忙站了起来，摇头道：“不是，不是！我只是帮别人来卖丹的…”
en_us: Jiang Yi was taken aback. He hurriedly stood up and, shaking his head, he answered, "No, no! I am just selling the elixir on someone else's behalf..."

source: 江逸被震住了，低头沉吟不语，去翊家肯定不可能的，不说他和武殿有协议，就算给江家知道了他也难逃一死，这可是叛族啊。
en_us: Jiang Yi was in awe. He mulled with his head lowered. Joining the Yi Family was out of the question; to say nothing of the agreement he had with the Martial Arts Hall, death would be an inevitable end if the Jiang Clan found out, it was an act of treachery against the family clan after all.

source: 江逸要的就是这种效果！
en_us: That outcome was exactly what Jiang Yi wanted!

source: 江逸见姬听雨不说话盯着他直看，一双漂亮的丹凤眼内都是迷蒙之色，又尴尬起来随口说道：“姬小姐，既然你找我陪练，那就打一场吧，不过还望手下留情哦。”
en_us: Seeing Ji Tingyu continuously stare at him in silence, with her pair of pretty phoenix eyes giving off a misty look, he felt awkward once again and as such quickly opened his mouth to say, "Young Mistress Ji, since you came searching for me for a practice match, how about we spar against each other in a match now? I hope that you please be merciful to me."

source: 江逸讪讪摸了摸头，他要是还手的话，这翊小姐元力被封印怕是一招就要被他撂倒了，不过此刻他能说什么？只能点了点头道：“好！”
en_us: Embarrassed, Jiang Yi scratched his head. If he retaliated against her moves, with her essence forces sealed off, he was afraid that with a single move he would knock her down. However, what else could he say at that moment? He had no choice but to nod and reply, "Alright!"

source: 江逸讪讪的摸了摸鼻子，走了出来，一拱手道：“江逸拜见柳长老，我……不是江松，我是来领丹药的。”
en_us: Jiang Yi awkwardly scratched his nose, walked out from where he was hiding, and cupped his hands as he greeted, "Greetings, Elder Liu. I... am not Jiang Song. I, Jiang Yi, am here to retrieve elixirs."

source: 江逸讪讪的站立，回了一句：“我不躲避，难道站着给你打？陪练又不是给人出气挨揍的……”
en_us: Jiang Yi stood still abashedly and retorted, "Should I not have dodged and let you hit me? Sparring partners are not punching bags for people to vent their anger on..."

source: 江逸讪讪的笑了笑，也不用这黑甲护卫带路了，径直进了武殿朝练功房那边走去。
en_us: Jiang Yi smiled, embarrassed. Not needing this guard clad in black armour to lead the way, he directly walked into the Martial Arts Hall and went straight towards the Technique Practising Room.

source: 江逸走后一柱香时间，练功房走廊内一道火红色身影就风风火火冲了过来，一走到大殿内立即在所有陪练脸上的面具上扫了一圈，很是急迫的问道：“杨管事，刚才和我对练的那个金牌陪练呢？”
en_us: Five minutes after Jiang Yi left, a fiery-red figure rushed over energetically through the corridor of the technique practising rooms. Upon walking into the central hall, the person immediately gazed around at the masks worn by all the sparring partners before, with much urgency, asking, "Manager Yang, where is that gold token-grade sparring partner whom I was practising with just now?"

source: 江逸越想越心动，实在不行也是被人揍一顿而已，沉吟了一阵，他咬牙朝武殿侧门走去，对着两名黑甲护卫拱手道：“我报名陪练！”
en_us: The more Jiang Yi thought about it, the more tempted he felt. Even if he could not make it, he was only going there to receive a beating from others. Sighing deeply, he gritted his teeth and walked in the direction of the side door of the Martial Arts Hall. Cupping his hands in greeting to the two guards clad in black armor, he said, "I am here to register as a sparring partner!"

source: 江逸跟着这管事进了旁边的一个雅阁内，那管事请江逸坐下，这才抬手道：“请出示一下丹药，如果是好丹，我们会给出合理的价格。”
en_us: Jiang Yi followed the housekeeper into an elegant booth at the side. The housekeeper offered Jiang Yi a seat before raising his hand as he said, "Please display your elixirs. If they are good-quality elixirs, we will give you a reasonable monetary offer."

source: 江逸身子一缩走了出去，暗道这五年算是卖身给武殿了，拿了武殿的钱不干活？那就等着武殿无穷无尽的追杀，想到大陆上每一个城池都有武殿分部，江逸都有些不寒而栗……
en_us: Jiang Yi contracted his body and left the room. He muttered to himself about how he had just basically sold his body and soul to the Martial Arts Hall for five years. How could he take money from the Martial Arts Hall and not work for them? If he did not, he would have to face the endless chase by the Martial Arts Hall to kill him. Thinking about how every city in the continent had a branch of the Martial Arts Hall, Jiang Yi could not help but shudder with some fear...

source: 江逸身子一转，转到马飞身后反手勒住他的脖子，另外一只手握着青色短剑，元力灌注紧紧贴着马飞的胸口，只要微微用力这短剑将会刺入马飞的胸口，他目光冷冷的朝众人一扫，沉喝道：“全部退后十丈！”
en_us: Jiang Yi turned to move behind Ma Fei and restrained his neck with a hand. In his other hand was the teal-colored short sword, which was infused with essence force and at the moment being pressed tightly against Ma Fei's chest, ready to penetrate with just the slightest force. Jiang Yi's cold gaze swept across everyone and bellowed, "All of you move back ten feet!"

source: 江逸身子一震，整个人都战栗起来，因为他明显感觉伤口恢复的速度开始加快，而且越来越快，最终治疗的速度达到了原先的五六倍左右，药效都可比人阶上品疗伤丹药了。
en_us: Jiang Yi felt his body tremble and he shuddered. Evidently, his healing speed had accelerated, to the point that the healing speed reached approximately five or six times the original speed. The effects were now on par with Man-tier superior-grade healing elixirs.

source: 江逸身子一颤，但还是很不相信，冷笑道：“证据呢？你凭什么说我是镇西王的儿子？我还说你是我的儿子呢！”
en_us: Jiang Yi felt a chill up his spine, but he still did not quite believe it and laughed coldly, "Can you prove it? How can you say that I am the Lord's son? Well based on what you say, I can even say that I'm your son!"

source: 江逸身子一颤，江小奴没有一点实力，居然妄图蜉蝣撼树？这要是给这护卫踹上一脚，不得活活踹死啊？
en_us: Jiang Yi trembled. To think that Jiang Xiaonu would try overestimate her capabilities despite her clear lack of strength! If the guard tried to kick her off, wouldn't she end up being kicked to death?

source: 江逸身子一颤，猛然睁开眼睛，面色瞬间变得狰狞，那样子就像一只被激怒鬃毛竖起的狮子王，他身子从地上一跃而起，疯狂的朝前院飙射而去……
en_us: Jiang Yi's body trembled as he opened his eyes suddenly. His face instantly turned grim. He looked like an agitated lion with a bristling mane. Jumping up from the ground, he dashed towards the front yard like a maniac…

source: 江逸身子一颤，还没等他说话，不知什么时候来的柳长老却板着脸说道：“一点药草要取那么久？还不拿出来？哼……废物！”
en_us: Jiang Yi shuddered. Without waiting for him to speak, Elder Liu, whom Jiang Yi had no idea when he entered the room, spoke with a stern face, "How long do you want to take to retrieve a few herbs? Hurry up and bring them over here! Hmph... useless good-for-nothing!"

source: 江逸身子不动，冷然望着江松说了一句。结果江松脸色一变，江逸还没开始数数就慌忙扶着墙壁，一蹦一跳的凭借左腿快速朝远处逃去，只是十几息时间就消失不见了……
en_us: Jiang Yi remained motionless and stared coldly at Jiang Song. As a result, Jiang Song's face changed color. Before Jiang Yi had even started counting down, he hastily relied on his left leg and the wall to hop away. He vanished from sight in about thirty seconds...

source: 江逸身子也滚落在地，但他却如一只猎豹般立即从地上弹射而起，朝江如虎冲去。
en_us: Jiang Yi had also tumbled onto the ground, yet he managed to immediately leap off the ground like a cheetah and once again rush towards Jiang Ruhu.

source: 江逸身子快速在地上转圈起来，用最大的力量，最快的速度将江如龙抡得在半空转圈，等他脑袋差不多晕晕乎乎的时候，再移动脚步猛然朝旁边的墙壁砸去……
en_us: Jiang Yi began to quickly turn his body and used all his strength to whirl Jiang Rulong with his top speed. When Jiang Rulong's mind was in a dazed state, Jiang Yi then moved vigorously to smash Jiang Rulong into the wall...

source: 江逸身子飙射而入，目光如刀子般在里面扫去，一看之下他更是差点气疯了。
en_us: Jiang Yi tore into the room, his eyes sweeping across the room like daggers. What greeted him nearly blew his top.

source: 江逸身影突然在原地一顿，双手一松，江如龙的身子如炮弹般朝上空飞射而去。同时江逸的双腿一蹬，身子快速的跟上，双手抓做落地的江如龙猛然往下压，单腿膝盖却重重的朝他腰身顶去……
en_us: Jiang Yi's body suddenly stayed in place, he then loosened both his hands and launched Jiang Rulong's body high up like a cannonball. At the same time, he catapulted himself with both his legs and swiftly caught up to Jiang Rulong. He used both his hands to grab the falling Jiang Rulong and pressed downwards, using a single knee to position at Jiang Rulong's waist...

source: 江逸转身，痛苦的闭上眼睛，大步朝外面走去，没有再回头看小奴一眼，因为……他生怕多看一眼会不舍得离去。
en_us: Jiang Yi turned around and closed his eyes in anguish. He marched out the doors without a backward glance at Xiaonu, for... he was afraid that looking at her any longer would render him incapable of leaving.

source: 江逸轻叹一声，从怀中取出一把青色的短剑，看着上面流转的青光，他眼中流露出深深的担忧之色。马飞应该找了他一个月吧？他找不到自己，会不会想方设法去找江小奴的麻烦？
en_us: Jiang Yi heaved a sigh and took out a teal-colored short sword from his chest pocket. Staring at its gyrating teal radiance, a deeply troubled look showed on his face. Ma Fei must have been searching for him for a month. With Jiang Yi missing, would he attempt to give Jiang Xiaonu a hard time instead?

source: 江逸轻松过了两人，却似乎忘记还有一人？那铸鼎境三重的武者被江逸晃了一枪，此刻醒悟过来顿时恼羞成怒，大步朝江逸冲来，扬起拳头狠狠对着他的背后砸去。
en_us: Jiang Yi had easily defeated two person, but did it seem as though he forgot one more person? Jiang Yi had flashed past that martial artist with a power level at the third stage of the Cast Tripod Realm. At that moment, he finally came to himself and immediately flew into a rage out of humiliation. He rushed towards Jiang Yi with wide steps and raised up his fists before ferociously smashing downwards onto Jiang Yi's back.

source: 江逸运转一缕黑色元力，在调集一些蓝色元力融合起来，缓缓的控制朝脑袋游走而去。这黑色元力太少太少，不融合蓝色元力怕是不足以完成任何功用。
en_us: Jiang Yi circulated a strand of black essence force and combined it together with some assembled blue essence force, before slowly controlling its movement towards his head. This black essence force was lacking in quantity. If it was not combined with the blue one, he feared that on its own the black essence force was not enough to produce any effect.

source: 江逸这一顶，尽管没有黑色元力融合，但也是实实在在的一马之力，当下那铸鼎境三重武者立即惨叫一声，身子本能弓了下来，本去抓江逸左手的手掌也收了回去，捧住下身痛嚎起来。
en_us: Even though Jiang Yi's single hit was not combined with the power of the black essence force, the attack was nonetheless had an actual horsepower worth of strength. At the moment of impact, that martial artist at the third stage of the Cast Tripod Realm immediately cried out in extreme agony as his body instinctively bent downwards. He had even withdrawn the hand that was supposed to grasp Jiang Yi's left hand, instead using it to cup his crotch as he howled aloud over his searing pain.

source: 江逸这才微微颔首，肉痛的咬牙松开手，眼睁睁的看着才到手几天的紫金进了别人的荷包。
en_us: It was with this offer that Jiang Yi finally nodded silently. His heart ached as he gritted his teeth and released his grip, looking on helplessly as he saw the purple gold he got his hands on just a few days ago enter another person's wallet.

source: 江逸这次没有痛打落水狗了，他早早松开江松双手，漠然看着他惨叫不休，内心没有一丝同情之心。今日如果没有他没有黑色元力，此刻倒在地上惨叫的就是他了，这个世界就是那么残酷，没有实力只有被人欺辱！
en_us: This time, Jiang Yi did not continue beating up his fallen opponent. Instead, he released Jiang Song's hands. Coldly observing him scream relentlessly, Jiang Yi's heart did not feel any sense of sympathy. If he did not have any black essence force that day, the one lying on the ground crying in agony at the moment would have been him. The world was cruel. Those without any power would only end up being bullied and humiliated!

source: 江逸进来之后如此张狂的话语明显触怒了两人，不过江逸点名找江如虎的麻烦，两人城府极深，也不好喧宾夺主都冷冷一哼没有说话，目光投向江如虎，等着看好戏。
en_us: The presumptuous words that Jiang Yi said obviously enraged the two of them. But the one that Jiang Yi called out for, was Jiang Ruhu. They didn't want to claim what wasn't directed at them. They let out cold snorts and casted their sights at Jiang Ruhu, waiting for a good show.

source: 江逸连忙称是，快速离开管事房朝自家小院走去，内心却是暗暗苦恼，要是过两天这荣管事又来问要令牌，或者干脆上他家去要，不得立即暴露啊……
en_us: Jiang Yi promptly replied in the affirmative, before hastily leaving the housekeeping chamber and walking towards the direction of the small courtyard of his own home. He was inwardly distressed in his mind, however. Should Chief Rong return to demand the return of the command token over the next two days, or should he directly head to his house to request for it, his secret would immediately be revealed...

source: 江逸连忙起身，胡乱整理了一下破烂的衣袍，朝外面走去。
en_us: Jiang Yi hastily rose from the bed, hurriedly straightened out and tidied up his tattered clothes, and rushed out of the house.

source: 江逸迷茫了，他听说过丹药能回炉再造，但具体不知道怎么操作的，只看了一早上炼丹就能回炉再造的话，他就是炼丹天才了……
en_us: Jiang Yi was confused. He had heard before that elixirs could be reheated and refined, but he did not know how to perform the specific processes. If all he needed was to observe the refining process for a morning before being able to reheat and refine elixirs, he would probably be a genius in alchemy...

source: 江逸迷迷糊糊的睁开眼睛，感觉全身上下，特别是头部传来阵阵撕裂般的痛楚。他勉强撑起上半身，呲牙咧嘴地朝四处一望，这才发现自己依旧躺在江家西山的药田田埂上。
en_us: When Jiang Yi opened his eyes, he was greeted with a blurry world. Not an inch of his body was spared from the searing pain. Worst of all was his head, which throbbed with unbearable intensity. Red-faced and grimacing, Jiang Yi managed to raise his body up with what little strength he had. As he made sense of his immediate surroundings, Jiang Yi quickly realized that he was lying on an embankment in the Western Hills plantation, one of the many holdings owned by the Jiang Clan.

source: 江逸郁闷得要吐血了，睁开眼睛一扫，发现外面已经天亮了，附近的房间传来窸窸窣窣小奴起床的声音。
en_us: Jiang Yi was so melancholic that he wanted to vomit blood. When he opened his eyes and used his vision to sweep the room, he realized that the sky outside was already bright and rustling sounds of Xiaonu waking up were coming from the nearby room.

source: 江逸都不用黑色元力加持力量，只是凭借恐怖的视力和大成的武技就能轻松的战胜在场的所有人，铸鼎境五重？在他看来屁都不是。
en_us: Jiang Yi didn't even made use of the black essence forces to enhance his strength. He relied on his terrifying vision and Phenomenal Stage martial arts to easily defeat everyone here. Fifth stage of the Cast Tripod Realm? In his eyes, they couldn't defeat a pile of manure.

source: 江逸长长一叹，不再多想，全神贯注开始运转无名决提炼黑色元力。
en_us: Jiang Yi gave a long deep sigh. Not wanting to think about this any further, he placed all his attention on practicing the nameless cultivation technique to refine more black essence force.

source: 江逸闭上眼睛长长吐出一口气，他匕首再次对准马飞的胸口，全力勒住他的脖子让他的尖叫声戛然而止，他目光冰冷的望着刘管事，爆喝起来：“我和风月楼的恩怨今日就此了结，日后你们马家要报复我，尽管放手过来！管事……把我的紫金还给我，否则你家少爷就不是个废人，而是个死人了。”
en_us: Jiang Yi closed his eyes and gave a long exhale. He aimed the short sword at Ma Fei's chest again and cut him off in mid-scream with a full-force choke of his neck. He looked at Housekeeper Liu frostily and roared, "The scores between Fengyue Brothel and me are settled. If the Ma Family wish to seek revenge on me from now on, feel free to bring it on! Housekeeper... return my purple gold, or your young master would not just be useless, but dead."

source: 江逸闭上眼睛，小心翼翼地将注意力集中到自己脑海，便再一次看到了那几十个匪夷可思的神秘篆文，每一个字都无比清晰，黑色骨感，十足活泼，绝对不是幻觉。
en_us: Jiang Yi closed his eyes, carefully focusing his attention on his inner thoughts. Once again, he saw that unimaginably freakish and mysterious script. He could see each character unbelievably clear; they were black, skinny, and moved about energetically. This was definitely no figment of his imagination.

source: 江逸闭上眼睛，探查到眼睛附近的黑色元力果然还有一丝，没有完全消耗干净。再次过了一会，江逸眼中黑光才一闪，视力逐渐模糊起来，黑色元力完全消耗干净了。
en_us: Jiang Yi shut his eyes and checked that there was indeed a wisp of black essence force near his eyes, which had not been completely consumed yet. Once again, after a while, a black flash shone through Jiang Yi's eye, as his visison gradually became more blurry. It looked like the black essence force had completely been consumed.

source: 江逸闭上眼睛，细细感受着身体的变化。
en_us: Jiang Yi closed his eyes, faintly feeling the changes in his body.

source: 江逸闭目等死，这柳长老虽然是负责炼丹的，但战力在江家也是排前十的，这一掌下来他不得活活被拍死？
en_us: Jiang Yi closed his eyes and awaited the incoming slap. Even though Elder Liu was in charge of refining elixirs, he was considered one of the top ten most powerful in the Jiang Clan. Was he not going to be beaten to death with this single slap?

source: 江逸随便交代两句，让她在家呆着别出去，如果有人找上门就躲去后院。他匆匆的朝东院走去，想立即领回丹药，恢复伤势。
en_us: Jiang Yi casually briefed her with two instructions, asking her to stay at home and not go out; additionally, should someone come to the door, she had to hide in the backyard. He hastily walked in the direction of the Eastern Court to immediately retrieve an elixir and heal his injuries.

source: 江逸随便解释了一句，这十多天来他没日没夜的修炼，封印内的符文也再次消融了近百多枚，修炼速度也继续增加，加上杨管事无限的提供灵神丹，他的修炼速度能不快吗？按他估计应该最多三五天，就能突破铸鼎境三重了。
en_us: Jiang Yi provided some random explanation. In the past ten days, he had been cultivating round the clock and reduced close to a hundred characters of the runic patterns of his seal, which caused his cultivation speed to increase further. Coupled with the incessant supply of Spirit Pills from Manager Yang, how could his cultivation speed not be fast? By his calculations, he would be able to make a breakthrough in achieving the third stage of the Cast Tripod Realm.

source: 江逸青铜面具下的脸有些阴沉，嘴唇也有些干，望着马黑旗和柳河阴冷的目光，他有些不寒而栗。
en_us: Jiang Yi's expression, hidden beneath the bronze mask, was gloomy. His lips turned a little dry. The cold and ruthless looks on Ma Heiqi and Liu He made him shudder with unease.

source: 江逸面无表情的一步步朝众人走去，眼中都是冷意，此刻他下半身的黑色长袍被溅满了鲜血，一只手也被染红了，加上他身上凌冽的杀机，别有一番慑人之势。
en_us: Jiang Yi walked towards the group with an indifferent expression. With eyes of chill, Jiang Yi's black robes were covered fresh blood, so was one of his hand. In addition to his sharp killing intent, his entire figure was releasing a frightful presence.

source: 江逸面色一冷，只能脚步一滑，身形很飘逸的退入房间之内，将小奴朝地上一放，再次动用一缕黑色元力运转到拳头，对着一名冲进来的铸鼎境二重武者砸去。
en_us: Jiang Yi's expression turned cold. He could only slide back into the room. Placing Xiaonu on the ground, he once again transferred a wisp of black essence force to his fist and smashed it at the second-stage Cast Tripod Realm warrior who charged in.

source: 江逸面色一凛，暗到这风月楼果然背后有大势力支持，否则一个小小的管事怎么会认识江家的武技？
en_us: Jiang Yi gave the housekeeper a cold stern look. He thought to himself that this Fengyue Brothel did indeed have someone powerful backing them—otherwise, how would a mere housekeeper be able to recognize the martial art techniques of the Jiang Clan?

source: 江逸面色一沉，眼睛一瞪，又训斥道：“小奴，以后不许再说这样的浑话！这个世界少爷只有你这么一个亲人了，任何事情都没有你重要，知道吗？”
en_us: Jiang Yi's face darkened and stared intently at her before chiding, "Xiaonu, don't ever say this kind of silly thing again! You only have me, your young master, as your only loved one in this world, okay? Nothing is more important than you!

source: 江逸面色沉了下来，要想得到学院的重视，那必须成为精英学员，这样才能有机会认识那位天阶的治疗师，从而求他治疗江小奴。也只有成为精英学员才能得到驯化灵兽的秘术，而一旦成为精英学员，将会引起各大家族的注意和招揽，资料也会无可避免的被调查……
en_us: Jiangyi's face sunk. If he wanted to garner the school's attention and respect, he needed to become an elite student. Only then, would he have the opportunity to meet the Heaven-tier Healer and from there beg of him to treat Jiang Xiaonu. And only then, would he obtain the secret art of acclimatizing an Indricotherium.. However, if he were to become an elite student, it would attract the attention of the multiple influential Families, which would inevitably expose his background information...

source: 江逸顿了一下，迟疑问道：“我能随时离开吗？”
en_us: Jiang Yi paused for a moment. Hesitating briefly, he asked, "Can I leave at any time I want?"
